notas/Compiladores/notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-19 Mon 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Compiladores</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Compiladores</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59e1cd2">Rubros</a></li>
<li><a href="#org1fe9b02">Notas</a>
<ul>
<li><a href="#orge4dd3c9">Temario ( 15 / 08 / 23 )</a></li>
<li><a href="#org5ce506f">Autómatas (repaso)</a></li>
<li><a href="#org204d687">16 / 08 / 23</a>
<ul>
<li><a href="#org187a4d1">Compilador</a></li>
<li><a href="#org16b2d88">Jerarquía de Chomsky</a></li>
<li><a href="#orgbc2057a">Autómatas finitos y expresiones regulares</a></li>
<li><a href="#org9a229cc">Técnicas de optimización</a></li>
<li><a href="#org8fe29d9">Otros avances</a></li>
<li><a href="#org5c434f5">Intérpretes</a></li>
<li><a href="#org72e1bb4">Ensambladores</a></li>
<li><a href="#orgce992d4">Enlazador</a></li>
<li><a href="#orge4f1594">Preprocesadores</a></li>
<li><a href="#org0218083">Editores</a></li>
<li><a href="#org8d67870">Depuradores</a></li>
<li><a href="#org26b3bf9">Perfiladores</a></li>
<li><a href="#org9d878de">Administradores de proyecto</a></li>
</ul>
</li>
<li><a href="#org59ee0e1">17 / 08 / 23</a>
<ul>
<li><a href="#org72f8381">Lenguajes Regulares</a></li>
<li><a href="#org710f666">Regex</a></li>
</ul>
</li>
<li><a href="#org7cd0a27">21 / 08 / 23</a>
<ul>
<li><a href="#org68c653e">Introducción</a></li>
</ul>
</li>
<li><a href="#org3b21855">23 / 08 / 23</a>
<ul>
<li><a href="#orgb541dbb">Estructuras de datos principales en un compilador</a></li>
</ul>
</li>
<li><a href="#orgf26b7e2">28 / 08 / 23</a>
<ul>
<li><a href="#orgd584b89">Compiladores</a></li>
</ul>
</li>
<li><a href="#org1b57557">29 / 08 / 23</a>
<ul>
<li><a href="#org1f4a898">Gramáticas (libres del contexto)</a></li>
</ul>
</li>
<li><a href="#org3870cdb">30 / 08 / 23</a>
<ul>
<li><a href="#org0eae446">Teoría de Lenguajes de Programación y Teoría de Compiladores</a></li>
<li><a href="#orgf603ff1">Manejo de errores</a></li>
<li><a href="#org52000fa">Autohosting y bootstraping</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org59e1cd2" class="outline-2">
<h2 id="org59e1cd2">Rubros</h2>
<div class="outline-text-2" id="text-org59e1cd2">
<ul class="org-ul">
<li>Prácticas 20%</li>
<li>Proyecto final 30%</li>
<li>Exámenes parciales 30%</li>
<li>Exámenes semanales 20%</li>
</ul>
</div>
</div>

<div id="outline-container-org1fe9b02" class="outline-2">
<h2 id="org1fe9b02">Notas</h2>
<div class="outline-text-2" id="text-org1fe9b02">
</div>
<div id="outline-container-orge4dd3c9" class="outline-3">
<h3 id="orge4dd3c9">Temario ( 15 / 08 / 23 )</h3>
<div class="outline-text-3" id="text-orge4dd3c9">
<ol class="org-ol">
<li>Introducción</li>

<li>Análisis léxico y sintáctico</li>

<li>Análisis sintáctico descendente</li>

<li>Análisis sintáctico ascendente</li>

<li>Análisis semántico</li>

<li>Ambientes de ejecución</li>

<li>Generación de código</li>
</ol>
</div>
</div>

<div id="outline-container-org5ce506f" class="outline-3">
<h3 id="org5ce506f">Autómatas (repaso)</h3>
<div class="outline-text-3" id="text-org5ce506f">
<ul class="org-ul">
<li>Lenguaje: Es un conjunto de cadenas sobre un alfabeto \(\Sigma\).

<ul class="org-ul">
<li>\(\Sigma = \{a,b\}\)</li>

<li>\(\mathcal{L}=\{ab,ba\}\)</li>

<li>\(\mathcal{L}=\textit{todos las cadenas que tienen al menos 2 a's}\)</li>
</ul></li>
</ul>


<p>
Existen varias categorías de los lenguajes
</p>

<ul class="org-ul">
<li>Lenguajes Regulares</li>

<li>Lenguajes Libres del Contexto</li>

<li>Lenguajes Dependientes del Contexto</li>
</ul>


<p>
Un lenguaje puede tener la cadena vacía.
</p>

<ul class="org-ul">
<li>\(\varepsilon\): La cadena vacía; una palabra sin ningún símbolo.</li>

<li>\(\emptyset\neq\{\varepsilon\}\)</li>
</ul>


<p>
Existen operaciones que se pueden hacer entre los lenguajes
</p>

<ul class="org-ul">
<li>Unión (\(\mathcal{L}\cup\mathcal{M}\)): Contiene todas las palabras
de \(\mathcal{L}\) y todas las palabras de \(\mathcal{M}\).</li>

<li>Concatenación (\(\mathcal{L}\mathcal{M}\)): Todas las posibles
concatenaciones de palabras de \(\mathcal{L}\) con \(\mathcal{M}\)</li>

<li>Cerradura de Kleene:
<ul class="org-ul">
<li>\(\mathcal{L}^n=\mathcal{L}\mathcal{L}\cdots\mathcal{L}\) (n veces)</li>
<li>\(\mathcal{L}^0=\{\varepsilon\}\)</li>
<li>\(\mathcal{L}^*=\{\mathcal{L}^n\ |\ n}\geq 0\}\)</li>
</ul></li>

<li>Cerradura positiva: \(\mathcal{L}^+=\{L^n\ |\ n>0\}\)</li>
</ul>
</div>
</div>

<div id="outline-container-org204d687" class="outline-3">
<h3 id="org204d687">16 / 08 / 23</h3>
<div class="outline-text-3" id="text-org204d687">
</div>
<div id="outline-container-org187a4d1" class="outline-4">
<h4 id="org187a4d1">Compilador</h4>
<div class="outline-text-4" id="text-org187a4d1">
<p>
Un compilador es un programa que traduce de un lenguaje a
otro. Toma como entrada un programa escrito en un lenguaje fuente
(.java, .c) y produce un programa equivalente escrito en un
lenguaje objetivo (.class, .out, .exe).
</p>

<ul class="org-ul">
<li>El lenguaje fuente es un lenguaje de alto nivel.</li>

<li>El lenguaje objetivo es código objeto (máquina)</li>
</ul>


<p>
<i>No tomar a la ligera la palabra programa pues no es para nada</i>
<i>sencillo. La mayoría de computólogos nunca han escrito un</i>
<i>compilador completo</i>.
</p>
</div>
</div>

<div id="outline-container-org16b2d88" class="outline-4">
<h4 id="org16b2d88">Jerarquía de Chomsky</h4>
<div class="outline-text-4" id="text-org16b2d88">
<ul class="org-ul">
<li>Los estudios de <i>Noam Chomsky</i> condujeron a la clasificación de
los lenguajes de acuerdo a la complejidad de sus gramáticas y la
potencia de los algoritmos necesarios para reconocerlas.</li>

<li>La jerarquía se compone de cuatro niveles de gramáticas,
denominadas tipo 0, tipo 1, tipo 2 y tipo 3, cada una de las
cuales es una especialización de la anterior.

<ul class="org-ul">
<li>Tipo 0: Lenguajes sin restricciones</li>

<li>Tipo 1: Lenguajes dependientes de Contexto</li>

<li>Tipo 2: Lenguajes Libres de Contexto</li>

<li>Tipo 3: Lenguajes Regulares</li>
</ul></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org7a8c0eb"></a>Gramáticas libres de contexto<br />
<div class="outline-text-5" id="text-org7a8c0eb">
<ul class="org-ul">
<li>Las gramáticas de tipo 2, mejor conocidas como gramáticas
libres de contexto, han demostrado ser las más útiles para
especificar lenguajes de programación.</li>

<li>El problema de análisis sintáctico consiste en encontrar
algoritmos eficientes que reconozcan lenguajes libres de
contexto.</li>

<li>El estudio de este problema conduja al desarrollo de programas
que automatizan solución mediante los llamados compiladores de
compilador hoy llamados generadores de analizadores
sintácticos.</li>

<li>El más conocido de los programas es Yacc. Fue escrito por Steve
Johnson en 1975 para el sistema Unix.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgbc2057a" class="outline-4">
<h4 id="orgbc2057a">Autómatas finitos y expresiones regulares</h4>
<div class="outline-text-4" id="text-orgbc2057a">
<ul class="org-ul">
<li>Estas técnicas, corresponden a las gramáticas tipo 3 y se
encuentran relacionadas con las gramáticas libres de contexto.</li>

<li>Su estudio condujo a métodos simbólicos para expresar la
estructura de las palabras o tokens de un lenguaje de
programación.</li>

<li>Esto llevó al desarrollo de otra herramienta denominada
generador de analizadores léxicos, cuyo representante más
conocido es Lex.</li>
</ul>
</div>
</div>

<div id="outline-container-org9a229cc" class="outline-4">
<h4 id="org9a229cc">Técnicas de optimización</h4>
<div class="outline-text-4" id="text-org9a229cc">
<ul class="org-ul">
<li>Otro aspecto destacable en el área ha sido el desarrollo de
métodos para la generación de código objeto eficaz.</li>

<li>Estas técnicas suelen denominarse incorrectamente técnicas de
optimización, pero en realidad debería llamarse técnicas de
mejoramiento de código, pues casi nunca producen un código
objeto verdaderamente óptimo.</li>
</ul>
</div>
</div>

<div id="outline-container-org8fe29d9" class="outline-4">
<h4 id="org8fe29d9">Otros avances</h4>
<div class="outline-text-4" id="text-org8fe29d9">
<ul class="org-ul">
<li>Algoritmos para inferir y / o simplificar la información
contenida en un programa, por ejemplo el algoritmo de
unificación de tipos de <i>Hindley-Milner</i>.</li>

<li>Integración con los llamados entornos de desarrollo integrados.</li>
</ul>
</div>
</div>

<div id="outline-container-org5c434f5" class="outline-4">
<h4 id="org5c434f5">Intérpretes</h4>
<div class="outline-text-4" id="text-org5c434f5">
<ul class="org-ul">
<li>A diferencia de un compilador, un intérprete ejecuta un programa
fuente inmediatamente.</li>

<li>Cualquier lenguaje de programación se puede interpretar o
compilar, pero se puede preferir un intérprete a un compilador
dependiendo del lenguaje y del contexto.</li>

<li>Es un error hablar de un lenguaje compilado o lenguaje
interpretado pues existes lenguajes que tienen ambos tipos de
traductor.</li>

<li>Los compiladores comparten muchas de sus operaciones con los
intérpretes y existen incluso traductores híbridos.</li>
</ul>
</div>
</div>

<div id="outline-container-org72e1bb4" class="outline-4">
<h4 id="org72e1bb4">Ensambladores</h4>
<div class="outline-text-4" id="text-org72e1bb4">
<ul class="org-ul">
<li>Un ensamblador es un traductor para el lenguaje ensamblador.</li>

<li>Muchos compiladores generan lenguaje ensamblador como lenguaje
objetivo y por lo tanto depende de un ensamblador para terminar
la traducción a código objeto.</li>
</ul>
</div>
</div>
