content/notas/Compiladores/notas.org
*** Enlazador

    - Es un programa que combina los códigos objeto generados por el
      compilador o ensamblador así como otras piezas de código para
      generar un archivo ejecutable.
    - En los códigos objeto, el enlazador busca y agrega todas las
      bibliotecas necesarias para la ejecución del archivo.
    - Regulan el espacio de memoria que guardará el código de cada
      módulo.
    - Fusiona dos o más programas de códigos separados y establece un
      vínculo entre ellos.

*** Preprocesadores

    - Son programas separados que son invocados por el compilador
      antes de que comience la traducción real.
    - Eliminan los comentarios, incluyen otros archivos y ejecutan
      sustituciones de macros.
    - Pueden ser requeridos por el lenguaje (como en C) o pueden ser
      agregados posteriormente para que proporcionen facilidades
      adicionales.

*** Editores

    - Los compiladores aceptan programas fuente escritos usando
      cualquier editor.

    - Recientemente los compiladores han sido integrados junto a
      editores y otros programas en los IDEs de forma que puedan ser
      orientados hacia el formato o estructura del lenguaje de
      programación.

    - Se denominan basados en la estructura e icluyen alguna
      operaciones de un compilador, de manera que, por eemplo, pueda
      informarse a los programadores sobre los errores a medida que el
      programa se vaya escribiendo.

*** Depuradores

    - Son programas que se usan para determinar los errores de
      ejecución en un programa.

    - La ejecución de un programa con un depurador se diferencia de la
      ejeción directa en que el depurador mantiene al tanto de la
      mayoría o la totalidad de la información sobre el código fuente,
      tal como los números de línea y los nombres de variables y
      funciones.

    - También puede determinar la ejecución en puntos previamente
      especificados.
  
*** Perfiladores

    - Un perfilador es un programa que recolecta estadísticas sobre el
      comportamienbto de un programa objeto durante la ejecución.

    - Las estadísticas típicas que pueden ser de interés para los
      programadores son el número de veces que se llama cada función y
      el porcentaje de tiempo de ejecución que se ocupa en cada uno de
      ellos.

*** Administradores de proyecto

    - Los proyecto de software por lo general son tan grandes que
      tienen que ser realizados por grupos de programadores en lugar
      de por una sola persona.

    - En tales casos es importante que los archivos y éste es el
      trabajo de un programa de administración de proyecto.

    - Por ejemplo, un administrador de proyecto debería coordinar la
      combinación de diferentes versiones del mismo archivo producido
      por programadores diferentes.

** 17 / 08 / 23

*** Lenguajes Regulares

    Un lenguaje $\mathcal{L}$ bajo un alfabeto $\Sigma$ es regular si
    se puede generar a partir de lenguajes básicos ($\{\varepsilon\}$,
    $\emptyset$, $\{a\}$).

    - $\emptyset$ es regular

    - $\{\varepsilon\}$ es regular

    - Si $a\in\Sigma$, entonces $\{a\}$ es un lenguaje regular.

    - Si $\mathcal{L}$ es regular, entonces $\mathcal{L}^*$ también es
      regular.

    - Si $\mathcal{L}$ y $\mathcal{M}$ son lenguajes regulares,
      entonces $\mathcal{L}\cup\mathcal{M}$ y $\mathcal{LM}$ son
      regulares.

    - Son todas

*** Regex

    - $\emptyset$ es un regex

    - $\varepsilon$ es un regex

    - Si $a\in\Sigma$, entonces $a$ es un regex

    - Si $\alpha$ es un regex, entonces $\alpha^*$ es un regex

    - Si $\alpha$, $\beta$ son regex, entonces $\alpha+\beta$ y
      $\alpha\beta$ son regex.
   
** 21 / 08 / 23

*** Introducción

    Un compilador se compone internamente de varias etapas, o fases
    que realizan distintas operaciones lógicas.

    Es útil pensar en estas fases como piezas separadas aunque a
    menudo se integren juntas.

    | Código fuente                  |                     |
    |--------------------------------+---------------------|
    | Analizador léxico              | Detectar palabras   |
    |--------------------------------+---------------------|
    | Tokens                         |                     |
    |--------------------------------+---------------------|
    | Analizador sintáctico          | Analizar estructura |
    |--------------------------------+---------------------|
    | Árbol de sintaxis abstracta    |                     |
    |--------------------------------+---------------------|
    | Analizador semántico           | Analiza significado |
    |--------------------------------+---------------------|
    | Árbol con anotaciones          |                     |
    |--------------------------------+---------------------|
    | Optimizador de código fuente   |                     |
    |--------------------------------+---------------------|
    | Código intermedio              |                     |
    |--------------------------------+---------------------|
    | Generador de código            |                     |
    |--------------------------------+---------------------|
    | Código objetivo                |                     |
    |--------------------------------+---------------------|
    | Optimizador de código objetivo |                     |
    |--------------------------------+---------------------|
    | Código objetivo                |                     |

**** Analizador léxico

     - En esta fase se ejecuta la lectura del programa fuente, el cuál
       generalmente es dado en forma de cadena.
       
     - Se realiza lo que se conoce como análisis léxico es decir,
       recolecta subcadenas en unidades significativas denominadas
       lexemas o tokens las cuales son como las palabras de un
       lenguaje natural, como el español.
       
     - De este modo, podemos pensar en un analizador léxico como un
       programa que realiza una función similar al deletreo.

**** Analizador sintáctico

     - Recibe el código fuente en forma de tokens proveniente del
       analizador léxico y realiza un análisis sintáctico que
       determina la estructura del programa.

     - Determina los elementos estructurales del programa y sus
       relaciones.

     - Los resultados del análisis sintáctico usualmente se
       representan como árboles de análisis gramaticales o árboles de
       sintaxis abstracta.

     - Un árbol de análisis gramatical es un auxiliar para visualizar
       la sintaxis del programa o de un elemento de programa, pero no
       es eficaz en su representación de dicha estructura.

     - Los analizadores sintácticos tienden a generar un árbol de
       sintaxis abstracta (asa) en su lugar, el cual es una
       condensación de la información contenida en un árbol de
       análisis gramatical.

     - Se les llama abstractos porque representan una abstracción
       adicional de los árboles de análisis gramatical.

