notas/Compiladores/notas.html

<div id="outline-container-orgce992d4" class="outline-4">
<h4 id="orgce992d4">Enlazador</h4>
<div class="outline-text-4" id="text-orgce992d4">
<ul class="org-ul">
<li>Es un programa que combina los códigos objeto generados por el
compilador o ensamblador así como otras piezas de código para
generar un archivo ejecutable.</li>
<li>En los códigos objeto, el enlazador busca y agrega todas las
bibliotecas necesarias para la ejecución del archivo.</li>
<li>Regulan el espacio de memoria que guardará el código de cada
módulo.</li>
<li>Fusiona dos o más programas de códigos separados y establece un
vínculo entre ellos.</li>
</ul>
</div>
</div>

<div id="outline-container-orge4f1594" class="outline-4">
<h4 id="orge4f1594">Preprocesadores</h4>
<div class="outline-text-4" id="text-orge4f1594">
<ul class="org-ul">
<li>Son programas separados que son invocados por el compilador
antes de que comience la traducción real.</li>
<li>Eliminan los comentarios, incluyen otros archivos y ejecutan
sustituciones de macros.</li>
<li>Pueden ser requeridos por el lenguaje (como en C) o pueden ser
agregados posteriormente para que proporcionen facilidades
adicionales.</li>
</ul>
</div>
</div>

<div id="outline-container-org0218083" class="outline-4">
<h4 id="org0218083">Editores</h4>
<div class="outline-text-4" id="text-org0218083">
<ul class="org-ul">
<li>Los compiladores aceptan programas fuente escritos usando
cualquier editor.</li>

<li>Recientemente los compiladores han sido integrados junto a
editores y otros programas en los IDEs de forma que puedan ser
orientados hacia el formato o estructura del lenguaje de
programación.</li>

<li>Se denominan basados en la estructura e icluyen alguna
operaciones de un compilador, de manera que, por eemplo, pueda
informarse a los programadores sobre los errores a medida que el
programa se vaya escribiendo.</li>
</ul>
</div>
</div>

<div id="outline-container-org8d67870" class="outline-4">
<h4 id="org8d67870">Depuradores</h4>
<div class="outline-text-4" id="text-org8d67870">
<ul class="org-ul">
<li>Son programas que se usan para determinar los errores de
ejecución en un programa.</li>

<li>La ejecución de un programa con un depurador se diferencia de la
ejeción directa en que el depurador mantiene al tanto de la
mayoría o la totalidad de la información sobre el código fuente,
tal como los números de línea y los nombres de variables y
funciones.</li>

<li>También puede determinar la ejecución en puntos previamente
especificados.</li>
</ul>
</div>
</div>

<div id="outline-container-org26b3bf9" class="outline-4">
<h4 id="org26b3bf9">Perfiladores</h4>
<div class="outline-text-4" id="text-org26b3bf9">
<ul class="org-ul">
<li>Un perfilador es un programa que recolecta estadísticas sobre el
comportamienbto de un programa objeto durante la ejecución.</li>

<li>Las estadísticas típicas que pueden ser de interés para los
programadores son el número de veces que se llama cada función y
el porcentaje de tiempo de ejecución que se ocupa en cada uno de
ellos.</li>
</ul>
</div>
</div>

<div id="outline-container-org9d878de" class="outline-4">
<h4 id="org9d878de">Administradores de proyecto</h4>
<div class="outline-text-4" id="text-org9d878de">
<ul class="org-ul">
<li>Los proyecto de software por lo general son tan grandes que
tienen que ser realizados por grupos de programadores en lugar
de por una sola persona.</li>

<li>En tales casos es importante que los archivos y éste es el
trabajo de un programa de administración de proyecto.</li>

<li>Por ejemplo, un administrador de proyecto debería coordinar la
combinación de diferentes versiones del mismo archivo producido
por programadores diferentes.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org59ee0e1" class="outline-3">
<h3 id="org59ee0e1">17 / 08 / 23</h3>
<div class="outline-text-3" id="text-org59ee0e1">
</div>
<div id="outline-container-org72f8381" class="outline-4">
<h4 id="org72f8381">Lenguajes Regulares</h4>
<div class="outline-text-4" id="text-org72f8381">
<p>
Un lenguaje \(\mathcal{L}\) bajo un alfabeto \(\Sigma\) es regular si
se puede generar a partir de lenguajes básicos (\(\{\varepsilon\}\),
\(\emptyset\), \(\{a\}\)).
</p>

<ul class="org-ul">
<li>\(\emptyset\) es regular</li>

<li>\(\{\varepsilon\}\) es regular</li>

<li>Si \(a\in\Sigma\), entonces \(\{a\}\) es un lenguaje regular.</li>

<li>Si \(\mathcal{L}\) es regular, entonces \(\mathcal{L}^*\) también es
regular.</li>

<li>Si \(\mathcal{L}\) y \(\mathcal{M}\) son lenguajes regulares,
entonces \(\mathcal{L}\cup\mathcal{M}\) y \(\mathcal{LM}\) son
regulares.</li>

<li>Son todas</li>
</ul>
</div>
</div>

<div id="outline-container-org710f666" class="outline-4">
<h4 id="org710f666">Regex</h4>
<div class="outline-text-4" id="text-org710f666">
<ul class="org-ul">
<li>\(\emptyset\) es un regex</li>

<li>\(\varepsilon\) es un regex</li>

<li>Si \(a\in\Sigma\), entonces \(a\) es un regex</li>

<li>Si \(\alpha\) es un regex, entonces \(\alpha^*\) es un regex</li>

<li>Si \(\alpha\), \(\beta\) son regex, entonces \(\alpha+\beta\) y
\(\alpha\beta\) son regex.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7cd0a27" class="outline-3">
<h3 id="org7cd0a27">21 / 08 / 23</h3>
<div class="outline-text-3" id="text-org7cd0a27">
</div>
<div id="outline-container-org68c653e" class="outline-4">
<h4 id="org68c653e">Introducción</h4>
<div class="outline-text-4" id="text-org68c653e">
<p>
Un compilador se compone internamente de varias etapas, o fases
que realizan distintas operaciones lógicas.
</p>

<p>
Es útil pensar en estas fases como piezas separadas aunque a
menudo se integren juntas.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Código fuente</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Analizador léxico</td>
<td class="org-left">Detectar palabras</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tokens</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Analizador sintáctico</td>
<td class="org-left">Analizar estructura</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Árbol de sintaxis abstracta</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Analizador semántico</td>
<td class="org-left">Analiza significado</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Árbol con anotaciones</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Optimizador de código fuente</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Código intermedio</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Generador de código</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Código objetivo</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Optimizador de código objetivo</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Código objetivo</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul">
<li><a id="org0394148"></a>Analizador léxico<br />
<div class="outline-text-5" id="text-org0394148">
<ul class="org-ul">
<li>En esta fase se ejecuta la lectura del programa fuente, el cuál
generalmente es dado en forma de cadena.</li>

<li>Se realiza lo que se conoce como análisis léxico es decir,
recolecta subcadenas en unidades significativas denominadas
lexemas o tokens las cuales son como las palabras de un
lenguaje natural, como el español.</li>

<li>De este modo, podemos pensar en un analizador léxico como un
programa que realiza una función similar al deletreo.</li>
</ul>
</div>
</li>

<li><a id="org8970fcc"></a>Analizador sintáctico<br />
<div class="outline-text-5" id="text-org8970fcc">
<ul class="org-ul">
<li>Recibe el código fuente en forma de tokens proveniente del
analizador léxico y realiza un análisis sintáctico que
determina la estructura del programa.</li>

<li>Determina los elementos estructurales del programa y sus
relaciones.</li>

<li>Los resultados del análisis sintáctico usualmente se
representan como árboles de análisis gramaticales o árboles de
sintaxis abstracta.</li>

<li>Un árbol de análisis gramatical es un auxiliar para visualizar
la sintaxis del programa o de un elemento de programa, pero no
es eficaz en su representación de dicha estructura.</li>

<li>Los analizadores sintácticos tienden a generar un árbol de
sintaxis abstracta (asa) en su lugar, el cual es una
condensación de la información contenida en un árbol de
análisis gramatical.</li>

<li>Se les llama abstractos porque representan una abstracción
adicional de los árboles de análisis gramatical.</li>
</ul>
</div>
</li>
