content/notas/Compiladores/notas.org
**** Analizador semántico

     - La semántica de un programa es su /significado/, en oposición a
       su sintaxis o estructura.

     - La semántica determina el comportamiento de un programa durante
       ejecución, sin embargo, un compilador puede determinar otras
       características a partir de lo escrito.

     - Se hace referencia a tales características como semántica
       estática y el análisis de tal semántica es la tarea del
       analizador semántico.

     - La semántica dinámica de un programa, es decir, aquellas
       propiedades del programa que sólo pueden determinar al
       ehjecutarlo, no se pueden determinar mediante un compilador
       porque éste no ejecuta el programa.

     - Las características típicas de la semántica estática incluyen
       las declaraciones y la verificación de tipos.

     - Las partes extra de la información (como los tipos de datos)
       que se calculan mediante un analizador semántico se llaman
       atributos y con frecuencia se agregan al árbol como anotaciones
       (también se pueden introducir en la tabla de símbolos).

**** Optimizador de código fuente

     - Los compiladores a menudo incluyen varias etapas para el
       mejoramiento, y optimización del código.

     - El punto más anticipado en el que la mayoría de las etapas de
       optimización se pueden realizar es precisamente después del
       análisis semántico, y puede haber posibilidades para el
       mejoramiento del código que dependerán sólo del código fuente.

     - Se indica esta posibilidad al proporcionar esta operación como
       una fase por separado en el proceso de compilación.

     - Los compiladores muestran una amplia variación no sólo en los
       tipos de optimizaciones realizadas sino también en la
       colocación de las fases de optimización.

     - Muchas optimizaciones se pueden efectuar sobre el /asa/, pero es
       más fácil optimizar una forma que esté más cercana al código
       ensamblador.

     - Existen variedades diferentes como es el código en tres
       direcciones, denominado así porque contiene las direcciones de
       a lo más tres localidades de memoria.

     - Al emplear el código en tres direcciones, nos podemos referir a
       su salida como código intermedio.

     - Históricamente, el código intermedio ha hecho referencia a una
       forma de representación de código intermedia entre el código
       fuente y el código objeto tal como el código en tres
       direcciones.

     - También puede referirse de manera general a *cualquier*
       representación interna para el código fuente utilizado por el
       compilador.

     - En este sentido, también se puede hacer referencia al /asa/ como
       un código intermedio, y efectivamente el optimizador de código
       guente podría continuar el uso de esta representación en su
       salida.

     - En ocasiones este sentido general se indica al hacer referencia
       al código intermedio como *representación intermedia*, o *RI*.

**** Generador de código

     - El generador de código toma la *RI* y genera el código para la
       máquina objetivo.

     - Escribiremos el código objetivo en la forma de lenguaje
       ensamblador para facilitar su comprensión, aunque muchos
       compiladores generan el código objeto de manera directa.

     - Es en esta fase de la compilación en la que las propiedades de
       la máquina objetivo se convierten en el factor principal.

     - No sólo es necesario emplear instrucciones que existan en la
       máquina objetivo, sino que las decisiones respecto a la
       representación de los datos desempeñarán ahora también un papel
       principal, tal como cuántos bytes ocuparán las variables.

     - En esta fase el compilador intenta mejorar el código objetivo
       dado por el generador de código.

     - Dichas mejoras incluyen la selección de modos de
       direccionamiento para mejorar el rendimiento, reemplazando las
       instrucciones lentas por otras rápidas, y eliminando las
       operaciones redundantes o innecesarias.

** 23 / 08 / 23

*** Estructuras de datos principales en un compilador

    La interacción entre los algoritmos utilizados por las fases de un
    compilador y las estructuras de datos que soportan estas fases, es
    naturalmente, muy fuerte.

    Los programadores se esfuerzan por implementar estos algoritmos de
    una forma tan eficaz como sea posible, sin aumentar demasiado la
    complejidad.

    De manera ideal, un compilador debería poder compilar un programa
    en un tiempo proporcional al tamño del programa, es decir, $O(n)$
    en tiempo, donde $n#$ es una medida del tamaño del programa.

    Este este tema señalaremos algunas de las principales estructuras
    de datos que son necesarias para las fases como parte de su
    operación y que sirven para comunicar la información entre las
    fases.

**** Tokens

     Cuando un analizador léxico reúne los caracteres en un token,
     generalmente representa el token de manera simbólica, es decir,
     como valor de un tipo de dato enumerado que representa el
     conjunto de tokens del lenguaje fuente.

     En ocasiones también es necesario mantener la cadena de
     caracteres misma u otra información derivada de ella, tal como el
     nombre asociado con un token identificador o el valor de un token
     número.

     En la mayoría de los lenguajes el analizador léxico sólo necesita
     generar un token a la vez (esto se conoce como búsqueda de
     símbolo simple).

     En este caso se puede utilizar una variable global simple para
     mantener la información del token.

     En otros casos, puede ser necesario un arreglo (u otra
     estructura) de tokens.

**** Árboles de sintaxis abstracta

     Si el analizador sintáctico genera un ASA, por lo regular se
     construye como una estructura estándar basada en un apuntador que
     se asigna de manera dinámica a medida que se efectúa el análisis
     sintáctico.

     El árbol entero puede entonces conservarse como una variable
     simple que apunta al nodo raíz.

     Cada nodo en la estructura es una estructura, cuyos campos
     representan la información recolectada tanto por el analizador
     sintáctico, como posteriormente, por el analizador semántico.

     Por ejemplo, el tipo de dato de una expresión puede conservarse
     como un campo en el nodo del ASA para la expresión.

     En ocasiones para ahorrar espacio, estos campos se asignan de
     manera dinámica, o se almacenan en otras estructuras de datos,
     como la tabla de símbolos que permiten una asignación y
     desasignación selectivas.

     En realidad, cada nodo del ASA por sí mismo puede requerir
     atributos diferentes para ser almacenado, de acuerdo con la clase
     de estructura del lenguaje que represente.

     En esete caso, cada nodo en el ASA puede estar representado por
     un registro variable, con cada clase de nodo conteniendo
     solamente la información necesaria para ese caso.

