notas/Compiladores/notas.html

<li><a id="orgbfd4a40"></a>Analizador semántico<br />
<div class="outline-text-5" id="text-orgbfd4a40">
<ul class="org-ul">
<li>La semántica de un programa es su <i>significado</i>, en oposición a
su sintaxis o estructura.</li>

<li>La semántica determina el comportamiento de un programa durante
ejecución, sin embargo, un compilador puede determinar otras
características a partir de lo escrito.</li>

<li>Se hace referencia a tales características como semántica
estática y el análisis de tal semántica es la tarea del
analizador semántico.</li>

<li>La semántica dinámica de un programa, es decir, aquellas
propiedades del programa que sólo pueden determinar al
ehjecutarlo, no se pueden determinar mediante un compilador
porque éste no ejecuta el programa.</li>

<li>Las características típicas de la semántica estática incluyen
las declaraciones y la verificación de tipos.</li>

<li>Las partes extra de la información (como los tipos de datos)
que se calculan mediante un analizador semántico se llaman
atributos y con frecuencia se agregan al árbol como anotaciones
(también se pueden introducir en la tabla de símbolos).</li>
</ul>
</div>
</li>

<li><a id="org71bb08c"></a>Optimizador de código fuente<br />
<div class="outline-text-5" id="text-org71bb08c">
<ul class="org-ul">
<li>Los compiladores a menudo incluyen varias etapas para el
mejoramiento, y optimización del código.</li>

<li>El punto más anticipado en el que la mayoría de las etapas de
optimización se pueden realizar es precisamente después del
análisis semántico, y puede haber posibilidades para el
mejoramiento del código que dependerán sólo del código fuente.</li>

<li>Se indica esta posibilidad al proporcionar esta operación como
una fase por separado en el proceso de compilación.</li>

<li>Los compiladores muestran una amplia variación no sólo en los
tipos de optimizaciones realizadas sino también en la
colocación de las fases de optimización.</li>

<li>Muchas optimizaciones se pueden efectuar sobre el <i>asa</i>, pero es
más fácil optimizar una forma que esté más cercana al código
ensamblador.</li>

<li>Existen variedades diferentes como es el código en tres
direcciones, denominado así porque contiene las direcciones de
a lo más tres localidades de memoria.</li>

<li>Al emplear el código en tres direcciones, nos podemos referir a
su salida como código intermedio.</li>

<li>Históricamente, el código intermedio ha hecho referencia a una
forma de representación de código intermedia entre el código
fuente y el código objeto tal como el código en tres
direcciones.</li>

<li>También puede referirse de manera general a <b>cualquier</b>
representación interna para el código fuente utilizado por el
compilador.</li>

<li>En este sentido, también se puede hacer referencia al <i>asa</i> como
un código intermedio, y efectivamente el optimizador de código
guente podría continuar el uso de esta representación en su
salida.</li>

<li>En ocasiones este sentido general se indica al hacer referencia
al código intermedio como <b>representación intermedia</b>, o <b>RI</b>.</li>
</ul>
</div>
</li>

<li><a id="org5adae6e"></a>Generador de código<br />
<div class="outline-text-5" id="text-org5adae6e">
<ul class="org-ul">
<li>El generador de código toma la <b>RI</b> y genera el código para la
máquina objetivo.</li>

<li>Escribiremos el código objetivo en la forma de lenguaje
ensamblador para facilitar su comprensión, aunque muchos
compiladores generan el código objeto de manera directa.</li>

<li>Es en esta fase de la compilación en la que las propiedades de
la máquina objetivo se convierten en el factor principal.</li>

<li>No sólo es necesario emplear instrucciones que existan en la
máquina objetivo, sino que las decisiones respecto a la
representación de los datos desempeñarán ahora también un papel
principal, tal como cuántos bytes ocuparán las variables.</li>

<li>En esta fase el compilador intenta mejorar el código objetivo
dado por el generador de código.</li>

<li>Dichas mejoras incluyen la selección de modos de
direccionamiento para mejorar el rendimiento, reemplazando las
instrucciones lentas por otras rápidas, y eliminando las
operaciones redundantes o innecesarias.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3b21855" class="outline-3">
<h3 id="org3b21855">23 / 08 / 23</h3>
<div class="outline-text-3" id="text-org3b21855">
</div>
<div id="outline-container-orgb541dbb" class="outline-4">
<h4 id="orgb541dbb">Estructuras de datos principales en un compilador</h4>
<div class="outline-text-4" id="text-orgb541dbb">
<p>
La interacción entre los algoritmos utilizados por las fases de un
compilador y las estructuras de datos que soportan estas fases, es
naturalmente, muy fuerte.
</p>

<p>
Los programadores se esfuerzan por implementar estos algoritmos de
una forma tan eficaz como sea posible, sin aumentar demasiado la
complejidad.
</p>

<p>
De manera ideal, un compilador debería poder compilar un programa
en un tiempo proporcional al tamño del programa, es decir, \(O(n)\)
en tiempo, donde \(n#\) es una medida del tamaño del programa.
</p>

<p>
Este este tema señalaremos algunas de las principales estructuras
de datos que son necesarias para las fases como parte de su
operación y que sirven para comunicar la información entre las
fases.
</p>
</div>

<ul class="org-ul">
<li><a id="org11ea0ed"></a>Tokens<br />
<div class="outline-text-5" id="text-org11ea0ed">
<p>
Cuando un analizador léxico reúne los caracteres en un token,
generalmente representa el token de manera simbólica, es decir,
como valor de un tipo de dato enumerado que representa el
conjunto de tokens del lenguaje fuente.
</p>

<p>
En ocasiones también es necesario mantener la cadena de
caracteres misma u otra información derivada de ella, tal como el
nombre asociado con un token identificador o el valor de un token
número.
</p>

<p>
En la mayoría de los lenguajes el analizador léxico sólo necesita
generar un token a la vez (esto se conoce como búsqueda de
símbolo simple).
</p>

<p>
En este caso se puede utilizar una variable global simple para
mantener la información del token.
</p>

<p>
En otros casos, puede ser necesario un arreglo (u otra
estructura) de tokens.
</p>
</div>
</li>

<li><a id="org4aad96d"></a>Árboles de sintaxis abstracta<br />
<div class="outline-text-5" id="text-org4aad96d">
<p>
Si el analizador sintáctico genera un ASA, por lo regular se
construye como una estructura estándar basada en un apuntador que
se asigna de manera dinámica a medida que se efectúa el análisis
sintáctico.
</p>

<p>
El árbol entero puede entonces conservarse como una variable
simple que apunta al nodo raíz.
</p>

<p>
Cada nodo en la estructura es una estructura, cuyos campos
representan la información recolectada tanto por el analizador
sintáctico, como posteriormente, por el analizador semántico.
</p>

<p>
Por ejemplo, el tipo de dato de una expresión puede conservarse
como un campo en el nodo del ASA para la expresión.
</p>

<p>
En ocasiones para ahorrar espacio, estos campos se asignan de
manera dinámica, o se almacenan en otras estructuras de datos,
como la tabla de símbolos que permiten una asignación y
desasignación selectivas.
</p>

<p>
En realidad, cada nodo del ASA por sí mismo puede requerir
atributos diferentes para ser almacenado, de acuerdo con la clase
de estructura del lenguaje que represente.
</p>

<p>
En esete caso, cada nodo en el ASA puede estar representado por
un registro variable, con cada clase de nodo conteniendo
solamente la información necesaria para ese caso.
</p>
</div>
</li>
