content/notas/Compiladores/notas.org
**** Tabla de símbolos

     Esta estructura de datos mantiene la información aosicada con los
     identificadores: funciones variables, constantes y tipos de
     datos.

     Interactúa con casi todas las fases del compilador: el analizador
     léxico, el analizador sintáctico o el analizador semántico que
     puede introducir identificadores dentro de la tabal o agregar
     tipos de datos y otra información; y las fases de optimización y
     generación de código que utlizan la información proporcionada
     para efectuar selecciones apropiadas de código objeto.

     Puesto que tendrá solicitudes de acceso con tanta frecuencia, las
     operaciones de elimincación, inserción y acceso necesitan ser
     eficientes, preferiblemente operaciones de tiempo constante.

     Una estrucutra de datos básica para este propósito son las tablas
     de dispersión aunque también se pueden utilizar diversas
     estructuras de árbol, o se construyen tablas con el apoyo de una
     lista o pila.

**** Tabla de literales

     La búsqueda y la inserción rápida son esenciales para la tabla de
     literales, la cual almacena constantes y cadenas utilizadas en el
     programa.

     Sin embargo, una tabla de literales necesita impedir las
     eliminaciones porque sus datos se aplican globalmente al programa
     y una constante o cadena aparecerá sólo una vez en esta tabla.

     Es importante en la reducción del tamaño de un programa en la
     memoria la permitir la reutilización de constantes y cadenas.

     También es necesaria para que el generador de código construya
     direcciones simbólicas para las literales y para introducir
     definiciones de datos en el archivo de código objetivo.

**** Código intermedio

     De acuerdo con la clase de código intermedio y de las clases de
     optimizaciones realizadas, este código puede conservarse como un
     arreglo de cadenas, un archivo de texto temporal o bien una lista
     de estructuras ligadas.

     En los compiladores que realizan optimizaciones complejas debe
     ponerse particular atención a la selección de representaciones
     que permitan una fácil reorganización.

** 28 / 08 / 23

*** Compiladores

**** Introducción

     - La estructura de un compilador se puede ver desde distinto
       ángulos.

     - En temas anteriores describimos sus fases, las cuales
       representan la estrucutra lógica de un compilador.

     - Otros puntos de vista posibles son:

       - La estructura física del compilador

       - La secuenciación de las operaciones

     - La persona que desarrolla el compilador debería estar
       familiarizada con tantos puntos de vista de la estructura del
       compilador como sea posible, ya que la estructura del
       compilador será determinante para su confiabilidad, eficacia,
       utilidad y mantenimiento.

     - En este tema consideraremos otros aspectos en la estructura del
       compilador y señalaremos cómo se aplica cada punto de vista.

**** Análisis y síntesis

     - Las operaciones del compilador que analizan el programa fuente
       para calcular sus propiedades se clasifican como la parte de
       *análisis* del compilador, mientras que las operaciones
       involucradas en la producción del código traducido se conocen
       como śintesis del compilador.

     - Los análisis léxico, sintáctico y semántico pertenecen a la
       parte de análisis, mientras que la generación de código es la
       síntesis.

     - Las etapas de optimización pueden involucrar tanto análisis
       como síntesis.

     - El análisis tiende a ser más matemático y a comprendrerse
       mejor, mientras que la síntesis requiere de técnicas más
       especializadas.

     - Es útil separar las etapas de análisis de las etapas de
       síntesis, de modo que cada una se pueda modificar de manera
       independiente respecto a la otra.

**** Etapa inicial y etapa final

     - Considera al compilador separado en aquellas funciones que
       dependen sólo del lenguaje fuente (la etapa inicial /front-end/)
       y aquellas operaciones que dependen únicamente del leguaje
       objetivo (etapa final /back-end/).

     - Es similar a la división en análisis y síntesis: los
       analizadores léxico, sintáctico y semántico son parte de la
       etapa inicial, mientras que el generador de código es parte de
       la etapa final.

     - Algo de las optimizaciones puede ser dependiente del objetivo,
       y por lo tanto parte de la etapa final, mientras que la
       síntesis del código intermedio es a menudo dependiente del
       objetivo, y por consiguiente, parte de la etapa inicial. De
       manera ideal el compilador estaría estrictamente dividido en
       estas dos secciones, con la RI como el medio de comunicación
       entre ellas.

     - Esta estructura es especialmente importante para la
       portabilidad del compilador donde se diseña con un enfoque
       hacia la modificación, ya sea del código fuente o del código
       objetivo.

**** Pasadas

     - Un compilador a menudo encuentra conveniente procesar todo el
       programa varias veces antes de generar el código.

     - Estas repeticiones son conocidas como *pasadas*.

     - Después del aso inicial, donde se construye el ASA o una RI a
       partir de la fuente, una pasada consiste en procesar la RI
       agregando información a ella, alterando su estructura o
       produciendo una representación diferente.

     - Las pasadas pueden corresponder o no a las fases, a menudo una
       pasada consistirá de varias etapas.

     - En realidad, dependiendo del lenguae, un compilador puede ser
       de una pasada, en el que todas las fases se presentan en un
       paso único.

     - Esto resulta en una compilación eficaz pero también en un
       código objetivo menos eficiente.

     - La mayoría de los compiladores con optimizaciones utilizan más
       de una pasada; por lo regular se emplea una pasada para los
       análisis léxico y sintáctico, otra para el análisis semántico y
       optimización a nivel del fuente, y una tercera para generación
       de código y optimización a nivel del objetivo.

     - Existen compiladores que pueden emplear incluso más pasadas:
       cinco, seis e incluso ocho no son algo fuera de lo común.

** 29 / 08 / 23

*** Gramáticas (libres del contexto)

    \[G=\langle V,T,S,P \rangle\]

    - $V$ alfabeto de símbolos no terminales

    - $T$ un alfabeto de símbolos terminales

    - $S\in V$ símbolo inicial

    - $P$ un conjunto de producciones

** 30 / 08 / 23

