notas/Compiladores/notas.html

<li><a id="org77f6e6a"></a>Tabla de símbolos<br />
<div class="outline-text-5" id="text-org77f6e6a">
<p>
Esta estructura de datos mantiene la información aosicada con los
identificadores: funciones variables, constantes y tipos de
datos.
</p>

<p>
Interactúa con casi todas las fases del compilador: el analizador
léxico, el analizador sintáctico o el analizador semántico que
puede introducir identificadores dentro de la tabal o agregar
tipos de datos y otra información; y las fases de optimización y
generación de código que utlizan la información proporcionada
para efectuar selecciones apropiadas de código objeto.
</p>

<p>
Puesto que tendrá solicitudes de acceso con tanta frecuencia, las
operaciones de elimincación, inserción y acceso necesitan ser
eficientes, preferiblemente operaciones de tiempo constante.
</p>

<p>
Una estrucutra de datos básica para este propósito son las tablas
de dispersión aunque también se pueden utilizar diversas
estructuras de árbol, o se construyen tablas con el apoyo de una
lista o pila.
</p>
</div>
</li>

<li><a id="org20aaabc"></a>Tabla de literales<br />
<div class="outline-text-5" id="text-org20aaabc">
<p>
La búsqueda y la inserción rápida son esenciales para la tabla de
literales, la cual almacena constantes y cadenas utilizadas en el
programa.
</p>

<p>
Sin embargo, una tabla de literales necesita impedir las
eliminaciones porque sus datos se aplican globalmente al programa
y una constante o cadena aparecerá sólo una vez en esta tabla.
</p>

<p>
Es importante en la reducción del tamaño de un programa en la
memoria la permitir la reutilización de constantes y cadenas.
</p>

<p>
También es necesaria para que el generador de código construya
direcciones simbólicas para las literales y para introducir
definiciones de datos en el archivo de código objetivo.
</p>
</div>
</li>

<li><a id="org155c8a5"></a>Código intermedio<br />
<div class="outline-text-5" id="text-org155c8a5">
<p>
De acuerdo con la clase de código intermedio y de las clases de
optimizaciones realizadas, este código puede conservarse como un
arreglo de cadenas, un archivo de texto temporal o bien una lista
de estructuras ligadas.
</p>

<p>
En los compiladores que realizan optimizaciones complejas debe
ponerse particular atención a la selección de representaciones
que permitan una fácil reorganización.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf26b7e2" class="outline-3">
<h3 id="orgf26b7e2">28 / 08 / 23</h3>
<div class="outline-text-3" id="text-orgf26b7e2">
</div>
<div id="outline-container-orgd584b89" class="outline-4">
<h4 id="orgd584b89">Compiladores</h4>
<div class="outline-text-4" id="text-orgd584b89">
</div>
<ul class="org-ul">
<li><a id="org126700a"></a>Introducción<br />
<div class="outline-text-5" id="text-org126700a">
<ul class="org-ul">
<li>La estructura de un compilador se puede ver desde distinto
ángulos.</li>

<li>En temas anteriores describimos sus fases, las cuales
representan la estrucutra lógica de un compilador.</li>

<li>Otros puntos de vista posibles son:

<ul class="org-ul">
<li>La estructura física del compilador</li>

<li>La secuenciación de las operaciones</li>
</ul></li>

<li>La persona que desarrolla el compilador debería estar
familiarizada con tantos puntos de vista de la estructura del
compilador como sea posible, ya que la estructura del
compilador será determinante para su confiabilidad, eficacia,
utilidad y mantenimiento.</li>

<li>En este tema consideraremos otros aspectos en la estructura del
compilador y señalaremos cómo se aplica cada punto de vista.</li>
</ul>
</div>
</li>

<li><a id="orgfdcdb46"></a>Análisis y síntesis<br />
<div class="outline-text-5" id="text-orgfdcdb46">
<ul class="org-ul">
<li>Las operaciones del compilador que analizan el programa fuente
para calcular sus propiedades se clasifican como la parte de
<b>análisis</b> del compilador, mientras que las operaciones
involucradas en la producción del código traducido se conocen
como śintesis del compilador.</li>

<li>Los análisis léxico, sintáctico y semántico pertenecen a la
parte de análisis, mientras que la generación de código es la
síntesis.</li>

<li>Las etapas de optimización pueden involucrar tanto análisis
como síntesis.</li>

<li>El análisis tiende a ser más matemático y a comprendrerse
mejor, mientras que la síntesis requiere de técnicas más
especializadas.</li>

<li>Es útil separar las etapas de análisis de las etapas de
síntesis, de modo que cada una se pueda modificar de manera
independiente respecto a la otra.</li>
</ul>
</div>
</li>

<li><a id="org2c06e3b"></a>Etapa inicial y etapa final<br />
<div class="outline-text-5" id="text-org2c06e3b">
<ul class="org-ul">
<li>Considera al compilador separado en aquellas funciones que
dependen sólo del lenguaje fuente (la etapa inicial <i>front-end</i>)
y aquellas operaciones que dependen únicamente del leguaje
objetivo (etapa final <i>back-end</i>).</li>

<li>Es similar a la división en análisis y síntesis: los
analizadores léxico, sintáctico y semántico son parte de la
etapa inicial, mientras que el generador de código es parte de
la etapa final.</li>

<li>Algo de las optimizaciones puede ser dependiente del objetivo,
y por lo tanto parte de la etapa final, mientras que la
síntesis del código intermedio es a menudo dependiente del
objetivo, y por consiguiente, parte de la etapa inicial. De
manera ideal el compilador estaría estrictamente dividido en
estas dos secciones, con la RI como el medio de comunicación
entre ellas.</li>

<li>Esta estructura es especialmente importante para la
portabilidad del compilador donde se diseña con un enfoque
hacia la modificación, ya sea del código fuente o del código
objetivo.</li>
</ul>
</div>
</li>

<li><a id="org1bc0fa4"></a>Pasadas<br />
<div class="outline-text-5" id="text-org1bc0fa4">
<ul class="org-ul">
<li>Un compilador a menudo encuentra conveniente procesar todo el
programa varias veces antes de generar el código.</li>

<li>Estas repeticiones son conocidas como <b>pasadas</b>.</li>

<li>Después del aso inicial, donde se construye el ASA o una RI a
partir de la fuente, una pasada consiste en procesar la RI
agregando información a ella, alterando su estructura o
produciendo una representación diferente.</li>

<li>Las pasadas pueden corresponder o no a las fases, a menudo una
pasada consistirá de varias etapas.</li>

<li>En realidad, dependiendo del lenguae, un compilador puede ser
de una pasada, en el que todas las fases se presentan en un
paso único.</li>

<li>Esto resulta en una compilación eficaz pero también en un
código objetivo menos eficiente.</li>

<li>La mayoría de los compiladores con optimizaciones utilizan más
de una pasada; por lo regular se emplea una pasada para los
análisis léxico y sintáctico, otra para el análisis semántico y
optimización a nivel del fuente, y una tercera para generación
de código y optimización a nivel del objetivo.</li>

<li>Existen compiladores que pueden emplear incluso más pasadas:
cinco, seis e incluso ocho no son algo fuera de lo común.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1b57557" class="outline-3">
<h3 id="org1b57557">29 / 08 / 23</h3>
<div class="outline-text-3" id="text-org1b57557">
</div>
<div id="outline-container-org1f4a898" class="outline-4">
<h4 id="org1f4a898">Gramáticas (libres del contexto)</h4>
<div class="outline-text-4" id="text-org1f4a898">
<p>
\[G=\langle V,T,S,P \rangle\]
</p>

<ul class="org-ul">
<li>\(V\) alfabeto de símbolos no terminales</li>

<li>\(T\) un alfabeto de símbolos terminales</li>

<li>\(S\in V\) símbolo inicial</li>

<li>\(P\) un conjunto de producciones</li>
</ul>
</div>
</div>
</div>
