content/notas/Compiladores/notas.org
*** Teoría de Lenguajes de Programación y Teoría de Compiladores

    - Hablamos temas atrás sobre cómo las estructuras léxicas y
      sintácticas de un lenguaje de programación por lo regular son
      especificadas en términos formales y utilizan expresiones
      regulares y gramáticas libres del contexto.

    - Sin embargo, la semántica de un lenguaje de programación todavía
      es comúnmente especificada utilizando descripciones en lenguaje
      natural.

    - Estas descripciones son recopiladas en la documentación del
      lenguaje de programación.

    - Cuando se crean nuevos lenguajes de programación, su diseño y
      compilador con frecuencia son dearrollados de manera simultánea,
      puesto que las técnicas disponibles para los desarrolladores de
      compiladores, pueden tener un impacto sobre el diseño del
      lenguaje de programación.

    - Similarmente la manera en que se define un lenguaje de
      programación tendrá un impacto fundamental sobre las técnicas
      que son necesarias para construir el compilador.

    - Una situación común es que el lenguaje de programación que se
      está implementando sea conocido y tenga un diseño ya existente.

    - En muchos de estos casos, dichos lenguajes alcanzan el nivel de
      lenguaje estándar que son aprobados por organizaciones como ANSI
      o ISO.

    - Esto a menudo no es una tarea sencilla, pero en ocasiones sí
      tiene ciertas ventajas debido principalmente a la existencia de
      baterías de pruebas estándar.

    - Ocasionalmente los lenguajes cuentan con una semántica definida
      en términos matemáticos, por ejemplo, usando un estilo
      operacional.

    - En estos casos es posible dar una prueba matemática de que un
      compilador se adhiere a la definición. Sin embargo, es una tarea
      difícil.

    - El diseño del lenguaje también interfiere con el comportamiento
      y estructura de los ambientes de ejecución.

*** Manejo de errores

    - Una de las funciones más importantes de un compilador es su
      respuesta a los errores

    - Una definición de un lenguaje por lo general requerirá no
      solamente que los errores estáticos sean detectados por un
      compilador, sino también ciertos errores de ejecución.

    - Esto requiere que un compilador genere código extra, el cual
      realizará priuebas de ejecución apropiadas para garantizar que
      aún con todos esos errores se provocará un evento apropiado
      durante la ejecución. El más simple será detener la ejecución.

    - A menudo esto no es adecuado, y una definición del lenguaje
      puede requerir la presencia de mecanismos para el manejo de
      excepciones.

    - No consideraremos la implementación de un mecanismo así...

*** Autohosting y bootstraping

**** Lenguaje anfitrión

     - Hemos analizado los lenguajes fuente y objetivo como factores
       en la estructura de un compilador y la utilidad de separar
       cuestiones de los lenguajes fuente y objetivo en etapas inicial
       y final.

     - No hemos mencionado el tercer lenguaje involucrado en el
       proceso de construcción de compiladores: el lenguaje en el que
       el compilador está escrito.

     - Para que el compilador se ejecute inmediatamente, este lenguaje
       anfitrión tendría que ser lenguaje de máquina.

     - Así fue como se escribieron los primeros compiladores, puesto
       que no existían compiladores todavía.

     - Un enfoque en la actualidad es escribir el compilador en otro
       lenguaje para el cual ya exista un compilador.

     - Si el compilador existente ya se ejecuta en la máquina
       objetivo, entonces necesitamos compilar utlizando el compilador
       existente para obtener un programa ejecutable.

**** Lenguaje anfitrión

     - Si el compilador existente para el lenguaje B se ejecuta en una
       máquina diferente a la máquina objetivo, entonces la situación
       es un poco más complicada.

     - La compilación produce entonces un compilador cruzado, es
       decir, un compilador que genera código objetivo para una
       máquina diferente de aquella en la que puede ejecutarse.

**** Diagramas T

     - La situación anterior y muchas otras más complejas se describen
       mejor al esquematizar un compilador como un diagrama T.

     - Un compilador escrito en el lenguaje A (Anfitrión) que traduce
       el lenguaje F (Fuente) en lenguaje O (Objetivo) se dibuja como
       un diagrama T:


     | F | -> | O |
     |---+----+---|
     |   | A  |   |

     - Observemos que esto es equivalente a decir que el compilador se
       ejecuta en la máquina A. Normalmente esperamos que A sea lo
       mismo que O, pero no es necesario que éste sea el caso.

     - Los diagramas T se pueden combinar en dos formas.
