notas/Compiladores/notas.html

<div id="outline-container-org3870cdb" class="outline-3">
<h3 id="org3870cdb">30 / 08 / 23</h3>
<div class="outline-text-3" id="text-org3870cdb">
</div>
<div id="outline-container-org0eae446" class="outline-4">
<h4 id="org0eae446">Teoría de Lenguajes de Programación y Teoría de Compiladores</h4>
<div class="outline-text-4" id="text-org0eae446">
<ul class="org-ul">
<li>Hablamos temas atrás sobre cómo las estructuras léxicas y
sintácticas de un lenguaje de programación por lo regular son
especificadas en términos formales y utilizan expresiones
regulares y gramáticas libres del contexto.</li>

<li>Sin embargo, la semántica de un lenguaje de programación todavía
es comúnmente especificada utilizando descripciones en lenguaje
natural.</li>

<li>Estas descripciones son recopiladas en la documentación del
lenguaje de programación.</li>

<li>Cuando se crean nuevos lenguajes de programación, su diseño y
compilador con frecuencia son dearrollados de manera simultánea,
puesto que las técnicas disponibles para los desarrolladores de
compiladores, pueden tener un impacto sobre el diseño del
lenguaje de programación.</li>

<li>Similarmente la manera en que se define un lenguaje de
programación tendrá un impacto fundamental sobre las técnicas
que son necesarias para construir el compilador.</li>

<li>Una situación común es que el lenguaje de programación que se
está implementando sea conocido y tenga un diseño ya existente.</li>

<li>En muchos de estos casos, dichos lenguajes alcanzan el nivel de
lenguaje estándar que son aprobados por organizaciones como ANSI
o ISO.</li>

<li>Esto a menudo no es una tarea sencilla, pero en ocasiones sí
tiene ciertas ventajas debido principalmente a la existencia de
baterías de pruebas estándar.</li>

<li>Ocasionalmente los lenguajes cuentan con una semántica definida
en términos matemáticos, por ejemplo, usando un estilo
operacional.</li>

<li>En estos casos es posible dar una prueba matemática de que un
compilador se adhiere a la definición. Sin embargo, es una tarea
difícil.</li>

<li>El diseño del lenguaje también interfiere con el comportamiento
y estructura de los ambientes de ejecución.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf603ff1" class="outline-4">
<h4 id="orgf603ff1">Manejo de errores</h4>
<div class="outline-text-4" id="text-orgf603ff1">
<ul class="org-ul">
<li>Una de las funciones más importantes de un compilador es su
respuesta a los errores</li>

<li>Una definición de un lenguaje por lo general requerirá no
solamente que los errores estáticos sean detectados por un
compilador, sino también ciertos errores de ejecución.</li>

<li>Esto requiere que un compilador genere código extra, el cual
realizará priuebas de ejecución apropiadas para garantizar que
aún con todos esos errores se provocará un evento apropiado
durante la ejecución. El más simple será detener la ejecución.</li>

<li>A menudo esto no es adecuado, y una definición del lenguaje
puede requerir la presencia de mecanismos para el manejo de
excepciones.</li>

<li>No consideraremos la implementación de un mecanismo así&#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org52000fa" class="outline-4">
<h4 id="org52000fa">Autohosting y bootstraping</h4>
<div class="outline-text-4" id="text-org52000fa">
</div>
<ul class="org-ul">
<li><a id="orgb73a651"></a>Lenguaje anfitrión<br />
<div class="outline-text-5" id="text-orgb73a651">
<ul class="org-ul">
<li>Hemos analizado los lenguajes fuente y objetivo como factores
en la estructura de un compilador y la utilidad de separar
cuestiones de los lenguajes fuente y objetivo en etapas inicial
y final.</li>

<li>No hemos mencionado el tercer lenguaje involucrado en el
proceso de construcción de compiladores: el lenguaje en el que
el compilador está escrito.</li>

<li>Para que el compilador se ejecute inmediatamente, este lenguaje
anfitrión tendría que ser lenguaje de máquina.</li>

<li>Así fue como se escribieron los primeros compiladores, puesto
que no existían compiladores todavía.</li>

<li>Un enfoque en la actualidad es escribir el compilador en otro
lenguaje para el cual ya exista un compilador.</li>

<li>Si el compilador existente ya se ejecuta en la máquina
objetivo, entonces necesitamos compilar utlizando el compilador
existente para obtener un programa ejecutable.</li>
</ul>
</div>
</li>

<li><a id="orgfbc7567"></a>Lenguaje anfitrión<br />
<div class="outline-text-5" id="text-orgfbc7567">
<ul class="org-ul">
<li>Si el compilador existente para el lenguaje B se ejecuta en una
máquina diferente a la máquina objetivo, entonces la situación
es un poco más complicada.</li>

<li>La compilación produce entonces un compilador cruzado, es
decir, un compilador que genera código objetivo para una
máquina diferente de aquella en la que puede ejecutarse.</li>
</ul>
</div>
</li>

<li><a id="org7c7763e"></a>Diagramas T<br />
<div class="outline-text-5" id="text-org7c7763e">
<ul class="org-ul">
<li>La situación anterior y muchas otras más complejas se describen
mejor al esquematizar un compilador como un diagrama T.</li>

<li>Un compilador escrito en el lenguaje A (Anfitrión) que traduce
el lenguaje F (Fuente) en lenguaje O (Objetivo) se dibuja como
un diagrama T:</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">O</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Observemos que esto es equivalente a decir que el compilador se
ejecuta en la máquina A. Normalmente esperamos que A sea lo
mismo que O, pero no es necesario que éste sea el caso.</li>

<li>Los diagramas T se pueden combinar en dos formas.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2024-08-19 Mon 11:43</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
